
"""
Задача №1.
Автогонщик в перший день ралі проїхав d км. Кожен наступний день
він збільшував пробіг на 10% від пробігу попереднього дня. Через
скільки днів авто-спортивних змагань сумарний пробіг автомобіля за
всі дні перевищить t км і яке значення сумарного пробігу? Введення
даних користувачем відбувається в порядку: d, t.

Автор: Новосад Сніжана
"""

# Введення даних користувачем
d = int(input("Введіть початковий пробіг автогонщика (км): "))
t = int(input("Введіть цільовий пробіг (км): "))

# Ініціалізація змінних
total_distance = d  # Сумарний пробіг
day = 1  # Лічильник днів

# Розрахунок
while total_distance <= t:
    day += 1
    daily_increment = d * 0.1  # Пробіг за поточний день
    total_distance += daily_increment

# Виведення результатів
print(f"Сумарний пробіг перевищить {t} км через {day} днів.")
print(f"Сумарний пробіг буде {total_distance} км.")
