"""
Задача №1.
Автогонщик в перший день ралі проїхав d км. Кожен наступний день
він збільшував пробіг на 10% від пробігу попереднього дня. Через
скільки днів авто-спортивних змагань сумарний пробіг автомобіля за
всі дні перевищить t км і яке значення сумарного пробігу? Введення
даних користувачем відбувається в порядку: d, t.

Автор: Новосад Сніжана
"""

# Введення даних користувачем
d = int(input("Введіть початковий пробіг автогонщика (км): "))
t = int(input("Введіть цільовий пробіг (км): "))

# Ініціалізація змінних
пробіг = d  # Сумарний пробіг
день = 1  # Лічильник днів

# Розрахунок
while пробіг <= t:
    день += 1
    денний_приріст = d // 10  # Пробіг за поточний день
    пробіг += денний_приріст

# Виведення результатів
print(f"Сумарний пробіг перевищить {t} км через {день} днів.")
print(f"Сумарний пробіг буде {пробіг} км.")
